Klipper3d/klipper/lib/asf/sam/utils/cmsis/samv71/include/samv71.h
/**
 * \file
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */
#ifndef _SAMV71_
#define _SAMV71_

#if defined (__SAMV71J19__)
#include "samv71j19.h"
#elif defined (__SAMV71J20__)
#include "samv71j20.h"
#elif defined (__SAMV71J21__)
#include "samv71j21.h"
#elif defined (__SAMV71N19__)
#include "samv71n19.h"
#elif defined (__SAMV71N20__)
#include "samv71n20.h"
#elif defined (__SAMV71N21__)
#include "samv71n21.h"
#elif defined (__SAMV71Q19__)
#include "samv71q19.h"
#elif defined (__SAMV71Q20__)
#include "samv71q20.h"
#elif defined (__SAMV71Q21__)
#include "samv71q21.h"
#elif defined (__SAMV71J19B__)
#include "samv71j19b.h"
#elif defined (__SAMV71J20B__)
#include "samv71j20b.h"
#elif defined (__SAMV71J21B__)
#include "samv71j21b.h"
#elif defined (__SAMV71N19B__)
#include "samv71n19b.h"
#elif defined (__SAMV71N20B__)
#include "samv71n20b.h"
#elif defined (__SAMV71N21B__)
#include "samv71n21b.h"
#elif defined (__SAMV71Q19B__)
#include "samv71q19b.h"
#elif defined (__SAMV71Q20B__)
#include "samv71q20b.h"
#elif defined (__SAMV71Q21B__)
#include "samv71q21b.h"
#else
  #error Library does not support the specified device.
#endif

#endif /* _SAMV71_ */
